In [1]:
import pandas as pd

In [5]:
df = pd.read_csv('./data.csv')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [41]:
df = pd.read_csv('./data', sep='|')
df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [42]:
df = pd.read_csv('./data_without_header', sep=',',header=None,names=['Nombre','Edad','Ciudad'])
df

  Nombre  Edad     Ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [64]:
df = pd.read_json('./data.json')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [65]:
#Muestra las primeras 5 columnas del df
df.head()
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [66]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [67]:
#Muestra las columnas del df
df.columns

Index(['nombre', 'edad', 'ciudad'], dtype='object')

In [55]:
df.describe

<bound method NDFrame.describe of   nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla>

In [56]:
df.tail(1)

  nombre  edad   ciudad
2  Pedro    35  Sevilla

In [57]:
#Permite ver una columna, solo es valido para una columna
df['edad']

0    25
1    30
2    35
Name: edad, dtype: int64

In [68]:
df[['nombre', 'edad']]

  nombre  edad
0   Juan    25
1  María    30
2  Pedro    35

In [73]:
df.loc[0]

nombre            Juan
edad                25
ciudad          Madrid
doble_edad          50
doble_edad_f        50
Name: 0, dtype: object

In [61]:
df[['ciudad']] = 'Barcelona'

In [69]:
def multiplier(edad):
    doble_edad = edad * 2
    return doble_edad

In [74]:
df['doble_edad'] = df['edad']*2
df

  nombre  edad     ciudad  doble_edad  doble_edad_f
0   Juan    25     Madrid          50            50
1  María    30  Barcelona          60            60
2  Pedro    35    Sevilla          70            70

In [76]:
df['doble_edad_f'] = df['edad'].apply(multiplier)
df

  nombre  edad     ciudad  doble_edad  doble_edad_f
0   Juan    25     Madrid          50            50
1  María    30  Barcelona          60            60
2  Pedro    35    Sevilla          70            70

Joins en pandas

In [83]:
#Joins (merge) en Pandas
import pandas as pd
df1 = pd.DataFrame(
    [
       (1, 345, 'B', True),
       (2, 100, 'C', False),
       (3, 300, 'B', False),
       (4, 151, 'A', False),
       (5, 212, 'A', True),
       (6, 121, 'C', False),
       (7, 333, 'B', True),
       (8, 456, 'C', True),
    ],
    columns=['id', 'value', 'colC', 'colD'])
df2 = pd.DataFrame(
    [
       (1, 111, 10.1, 3),
       (9, 56, 3.33, 10),
       (10, 17, 18.0, 8),
       (3, 567, 19.1, 4),
       (11, 98, 2.1, 1),
       (6, 31, 3.14, 12),
    ],
    columns=['id2', 'value', 'colE', 'colF'])

In [80]:
df1

   id  value colC   colD
0   1    345    B   True
1   2    100    C  False
2   3    300    B  False
3   4    151    A  False
4   5    212    A   True
5   6    121    C  False
6   7    333    B   True
7   8    456    C   True

In [ ]:
df2

In [81]:
df1.merge(df2, on='id')

   id  value_x colC   colD  value_y   colE  colF
0   1      345    B   True      111  10.10     3
1   3      300    B  False      567  19.10     4
2   6      121    C  False       31   3.14    12

In [82]:
df1.merge(df2,on='id',how='left')

   id  value_x colC   colD  value_y   colE  colF
0   1      345    B   True    111.0  10.10   3.0
1   2      100    C  False      NaN    NaN   NaN
2   3      300    B  False    567.0  19.10   4.0
3   4      151    A  False      NaN    NaN   NaN
4   5      212    A   True      NaN    NaN   NaN
5   6      121    C  False     31.0   3.14  12.0
6   7      333    B   True      NaN    NaN   NaN
7   8      456    C   True      NaN    NaN   NaN

In [84]:
#hacer merge de dos tablas que no tienen los nombre de columnas iguales
df1.merge(df2,left_on='id',right_on='id2')

   id  value_x colC   colD  id2  value_y   colE  colF
0   1      345    B   True    1      111  10.10     3
1   3      300    B  False    3      567  19.10     4
2   6      121    C  False    6       31   3.14    12

In [85]:
import pandas as pd
data = {'id': [1, 2, 3, 4, 5, 6, 7, 7],
        'first_name': ['Sigrid', 'Kennedy', 'Theodoric', 'Sigrid', 'Kennedy', 'Beatrix', 'Olimpia', 'Olimpia'],
        'last_name': ['Mannock', 'Donnell', 'Rivers', 'Mannock', 'Donnell', 'Parlett', 'Guenther', 'Guenther'],
        'age': [27, 31, 36, 27, 53, 48, 36, 36],
        'amount': [7.17, 1.90, 1.11, 7.17, 1.41, 6.69, 4.62, 4.62]}
df = pd.DataFrame(data, columns = ['id', 'first_name', 'last_name', 'age', 'amount'])
df

   id first_name last_name  age  amount
0   1     Sigrid   Mannock   27    7.17
1   2    Kennedy   Donnell   31    1.90
2   3  Theodoric    Rivers   36    1.11
3   4     Sigrid   Mannock   27    7.17
4   5    Kennedy   Donnell   53    1.41
5   6    Beatrix   Parlett   48    6.69
6   7    Olimpia  Guenther   36    4.62
7   7    Olimpia  Guenther   36    4.62

Limpieza de datos en Pandas

In [89]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
dtype: bool

In [91]:
df = df.drop_duplicates()
df

   id first_name last_name  age  amount
0   1     Sigrid   Mannock   27    7.17
1   2    Kennedy   Donnell   31    1.90
2   3  Theodoric    Rivers   36    1.11
3   4     Sigrid   Mannock   27    7.17
4   5    Kennedy   Donnell   53    1.41
5   6    Beatrix   Parlett   48    6.69
6   7    Olimpia  Guenther   36    4.62

In [95]:
#Reviso los duplicados pero excluye la columna id
# ~ significa negacion
df.duplicated(df.columns[~df.columns.isin(['id'])])

0    False
1    False
2    False
3     True
4    False
5    False
6    False
dtype: bool

In [97]:
#Quita los duplicados y conserva le primera coincidencia
df = df.drop_duplicates(df.columns[~df.columns.isin(['id'])], keep='first')
df

   id first_name last_name  age  amount
0   1     Sigrid   Mannock   27    7.17
1   2    Kennedy   Donnell   31    1.90
2   3  Theodoric    Rivers   36    1.11
4   5    Kennedy   Donnell   53    1.41
5   6    Beatrix   Parlett   48    6.69
6   7    Olimpia  Guenther   36    4.62